Show / Hide Table of Contents
Class RebarSingle
Represents a single main rebar in 3D space.
Inheritance
System.Object
OpenObject
OpenElementId
RebarBase
RebarSingle
Inherited Members
 RebarBase.Material
 RebarBase.Diameter
 RebarBase.RebarShape
 RebarBase.RebarParentElement
 RebarBase.RebarAllocationElement
 RebarBase.GroupId
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.RebarSingle,CI.StructuralElements", "CI.StructModel.Structure.IRebarSingle,CI.BasicTypes")]
public class RebarSingle : RebarBase
Constructors
Improve this Doc   View Source
RebarSingle()
create a new instance.
Declaration
public RebarSingle()
Properties
Improve this Doc   View Source
RotationXrad
Returns the rotation (in radians) of the rebar geometry (RebarShape). It is an angle of rotation around AxisX of the reference line.
Declaration
public double RotationXrad { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Translation
Returns the translation of the rebar geometry (RebarShape). It is an Insert point in reference line coordinate system
Declaration
public Vector3D Translation { get; set; }
Property Value
 Type |  Description
 Vector3D
 Improve this Doc
 View Source